# Conexión a bases de datos PostgreSQL en Python: `psycopg2` vs `SQLAlchemy`


<img src=https://miro.medium.com/v2/resize:fit:1400/1*UccAAe4ThpMESF-OOkzc3Q.png width="800">


Fuente: https://miro.medium.com/v2/resize:fit:1400/1*UccAAe4ThpMESF-OOkzc3Q.png

## ¿Qué es `psycopg2`?

`psycopg2` es una biblioteca de bajo nivel que permite conectarse directamente a bases de datos PostgreSQL desde Python. Es útil cuando se quiere tener control total sobre las consultas SQL que se ejecutan.

- Se recomienda para scripts pequeños o tareas puntuales.
- Es necesario escribir todo el SQL manualmente y gestionar la conexión y los errores.
- Requiere instalación mediante `pip install psycopg2-binary`

## ¿Qué es `SQLAlchemy`?

`SQLAlchemy` es una biblioteca de alto nivel que facilita el trabajo con bases de datos relacionales usando Python. Soporta varios motores (PostgreSQL, SQLite, MySQL, entre otros) y permite interactuar con las bases de datos de forma más estructurada y orientada a objetos.

- Es ideal para proyectos más grandes o en los que se necesita mantener el código limpio y reutilizable.
- Permite construir consultas sin escribir directamente SQL (aunque también se puede usar SQL puro).
- Requiere instalación mediante `pip install sqlalchemy`.

## ¿Qué significa "crear una conexión"?

Para usar cualquiera de estas bibliotecas, es necesario establecer una conexión con la base de datos. Esto implica proporcionar la información de acceso (nombre de la base de datos, usuario, contraseña, host y puerto) para que Python pueda comunicarse con ella.

## ¿Cuál herramienta usar?

| Escenario                                                  | Recomendación     |
|-----------------------------------------------------------|-------------------|
| Consultas simples, scripts rápidos                        | `psycopg2`        |
| Proyectos organizados, estructuras escalables             | `SQLAlchemy`      |
| Análisis con Pandas y exportación de datos desde SQL      | `SQLAlchemy`      |

## Se requiere la instalacion de ambos

In [1]:
pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in c:\users\lahlo\appdata\local\programs\python\python313\lib\site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\lahlo\appdata\local\programs\python\python313\lib\site-packages (2.0.38)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\lahlo\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\lahlo\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

# Usemos psycopg2

Este script en Python utiliza la librería psycopg2 para conectarse a un servidor PostgreSQL sin especificar una base de datos en particular, permitiendo realizar operaciones a nivel global.

* Primero, establece la conexión con la base de datos postgres, que es la base de datos predeterminada del sistema, y habilita el modo autocommit para ejecutar comandos como CREATE DATABASE. 
* Luego, crea un cursor para ejecutar instrucciones SQL y verifica si la base de datos northwind ya existe; si es así, la elimina con DROP DATABASE IF EXISTS. 
* Posteriormente, ejecuta CREATE DATABASE northwind para crear una nueva base de datos desde cero. 
* Finalmente, cierra el cursor y la conexión, asegurando que los recursos se liberen adecuadamente, y muestra un mensaje de confirmación indicando que la base de datos ha sido creada exitosamente.

## Establece la conexión con la base de datos postgres

In [1]:
import psycopg2

# Conéctate a PostgreSQL (sin especificar una base de datos)
conn = psycopg2.connect(database="postgres", #Es el nombre de la base de datos a la que te quieres conectar, postgres es por defecto
                        user="postgres", #Es el nombre de usuario que tiene permisos para conectarse a esa base de datos.
                        password="1234", 
                        host="localhost", #Indica dónde está alojada la base de datos. "localhost" significa que está en el mismo computador donde estás ejecutando el script de Python.
                        port="5432")
conn.autocommit = True  # Necesario para ejecutar CREATE DATABASE
cursor = conn.cursor()

# Crear la base de datos si no existe
cursor.execute("DROP DATABASE IF EXISTS northwind2;")  # Elimina si ya existe
cursor.execute("CREATE DATABASE northwind2;")  # Crea la base de datos

cursor.close()
conn.close()

print("Base de datos 'northwind2' creada exitosamente.")

Base de datos 'northwind2' creada exitosamente.

## Subir una base de datos en sql

In [2]:
import os
print(os.getcwd())

C:\Users\lahlo\Desafío Latam\Módulo 2 Python\Clase 7

In [3]:
import psycopg2

# Ruta del archivo SQL (ajusta esto según la ubicación de tu archivo)
sql_file_path = "northwinddb.sql"

# Conectar a la base de datos recién creada
conn = psycopg2.connect(database="postgres", 
                        user="postgres", 
                        password="1234", 
                        host="localhost", 
                        port="5432")
cursor = conn.cursor()

# Leer el archivo SQL y ejecutarlo
with open(sql_file_path, "r", encoding="utf-8") as sql_file:
    sql_script = sql_file.read()  # Lee todo el contenido del archivo SQL
    cursor.execute(sql_script)  # Ejecuta el script

conn.commit()  # Confirma los cambios
cursor.close()
conn.close()

print("Base de datos 'northwind' importada exitosamente.")

Base de datos 'northwind' importada exitosamente.

## Obtener los nombres de las tablas de la base de datos

In [4]:
import psycopg2

# Conectar a la base de datos Northwind
conn = psycopg2.connect(database="postgres", 
                        user="postgres", 
                        password="1234", 
                        host="localhost", 
                        port="5432")
cursor = conn.cursor()

# Ejecutar una consulta simple
cursor.execute("SELECT table_name FROM information_schema.tables WHERE table_schema='public';")
tables = cursor.fetchall()

cursor.close()
conn.close()

print("Tablas en la base de datos 'northwind':")
for table in tables:
    print(table[0])  # Imprimir nombres de las tablas

Tablas en la base de datos 'northwind':
clientes
pedidos
us_states
customers
orders
employees
shippers
products
order_details
categories
suppliers
region
territories
employee_territories
customer_demographics
customer_customer_demo

## Obtener una base de datos

In [6]:
import psycopg2
import pandas as pd

# Conectar a PostgreSQL
conn = psycopg2.connect(database="postgres", 
                        user="postgres", 
                        password="1234", 
                        host="localhost", 
                        port="5432")

# Escribir la consulta SQL (puedes cambiar la tabla según lo que necesites)
# query = "SELECT * FROM employee_territories;"
#query = "SELECT * FROM territories;"
query = "SELECT * FROM products;"

# Cargar los datos en un DataFrame
df = pd.read_sql(query, conn)

# Cerrar la conexión
conn.close()

C:\Users\lahlo\AppData\Local\Temp\ipykernel_14204\2235453244.py:17: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [7]:
df

,product_id,product_name,supplier_id,category_id,quantity_per_unit,unit_price,units_in_stock,units_on_order,reorder_level,discontinued
0,1,Chai,8,1,10 boxes x 30 bags,18.00,39,0,10,1
1,2,Chang,1,1,24 - 12 oz bottles,19.00,17,40,25,1
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.00,13,70,25,0
3,4,Chef Anton's Cajun Seasoning,2,2,48 - 6 oz jars,22.00,53,0,0,0
4,5,Chef Anton's Gumbo Mix,2,2,36 boxes,21.35,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...
72,73,Röd Kaviar,17,8,24 - 150 g jars,15.00,101,0,5,0
73,74,Longlife Tofu,4,7,5 kg pkg.,10.00,4,20,5,0
74,75,Rhönbräu Klosterbier,12,1,24 - 0.5 l bottles,7.75,125,0,25,0
75,76,Lakkalikööri,23,1,500 ml,18.00,57,0,20,0
76,77,Original Frankfurter grüne Soße,12,2,12 boxes,13.00,32,0,15,0

## Funcion para obtener una tabla de una base de datos solo pasadole el nombre de la tabla

In [9]:
import psycopg2
import pandas as pd

def leer_una_tabla(tabla):
    """
    Función para leer una tabla completa desde PostgreSQL
    y devolverla como DataFrame.
    Parámetros: tabla (str): Nombre de la tabla a leer.
    Retorna:
    - pd.DataFrame: DataFrame con los datos de la tabla.
    """
    # Conectar a la base de datos
    conn = psycopg2.connect(
        database="postgres",
        user="postgres",
        password="1234",
        host="localhost",
        port="5432"
    )

    # Crear la consulta SQL
    query = f"SELECT * FROM {tabla};"
    # Leer los datos en un DataFrame
    df = pd.read_sql(query, conn)
    # Cerrar la conexión
    conn.close()
    return df

# Importar las tablas "customers" y "orders"
df_order        = leer_una_tabla("customers")
df_orderdetails = leer_una_tabla("orders")

# Mostrar las primeras filas de cada DataFrame
print("\n Primeras filas de 'customers':")
print(df_order.head())

print("\n Primeras filas de 'orders':")
print(df_orderdetails.head())

 Primeras filas de 'customers':
  customer_id                        company_name        contact_name  \
0       ALFKI                 Alfreds Futterkiste        Maria Anders
1       ANATR  Ana Trujillo Emparedados y helados        Ana Trujillo
2       ANTON             Antonio Moreno Taquería      Antonio Moreno
3       AROUT                     Around the Horn        Thomas Hardy
4       BERGS                  Berglunds snabbköp  Christina Berglund

          contact_title                        address         city region  \
0  Sales Representative                  Obere Str. 57       Berlin   None
1                 Owner  Avda. de la Constitución 2222  México D.F.   None
2                 Owner                Mataderos  2312  México D.F.   None
3  Sales Representative                120 Hanover Sq.       London   None
4   Order Administrator                Berguvsvägen  8        Luleå   None

  postal_code  country           phone             fax
0       12209  Germany     030-0074321     030-0076545
1       05021   Mexico    (5) 555-4729    (5) 555-3745
2       05023   Mexico    (5) 555-3932            None
3     WA1 1DP       UK  (171) 555-7788  (171) 555-6750
4    S-958 22   Sweden   0921-12 34 65   0921-12 34 67

 Primeras filas de 'orders':
   order_id customer_id  employee_id  order_date required_date shipped_date  \
0     10248       VINET            5  1996-07-04    1996-08-01   1996-07-16
1     10249       TOMSP            6  1996-07-05    1996-08-16   1996-07-10
2     10250       HANAR            4  1996-07-08    1996-08-05   1996-07-12
3     10251       VICTE            3  1996-07-08    1996-08-05   1996-07-15
4     10252       SUPRD            4  1996-07-09    1996-08-06   1996-07-11

   ship_via  freight                  ship_name          ship_address  \
0         3    32.38  Vins et alcools Chevalier    59 rue de l'Abbaye
1         1    11.61         Toms Spezialitäten         Luisenstr. 48
2         2    65.83              Hanari Carnes       Rua do Paço, 67
3         1    41.34       Victuailles en stock    2, rue du Commerce
4         2    51.30           Suprêmes délices  Boulevard Tirou, 255

        ship_city ship_region ship_postal_code ship_country
0           Reims        None            51100       France
1         Münster        None            44087      Germany
2  Rio de Janeiro          RJ        05454-876       Brazil
3            Lyon        None            69004       France
4       Charleroi        None           B-6000      Belgium

C:\Users\lahlo\AppData\Local\Temp\ipykernel_14204\2233752475.py:24: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [10]:
df_order

,customer_id,company_name,contact_name,contact_title,address,city,region,postal_code,country,phone,fax
0,ALFKI,Alfreds Futterkiste,Maria Anders,Sales Representative,Obere Str. 57,Berlin,None,12209,Germany,030-0074321,030-0076545
1,ANATR,Ana Trujillo Emparedados y helados,Ana Trujillo,Owner,Avda. de la Constitución 2222,México D.F.,None,05021,Mexico,(5) 555-4729,(5) 555-3745
2,ANTON,Antonio Moreno Taquería,Antonio Moreno,Owner,Mataderos 2312,México D.F.,None,05023,Mexico,(5) 555-3932,None
3,AROUT,Around the Horn,Thomas Hardy,Sales Representative,120 Hanover Sq.,London,None,WA1 1DP,UK,(171) 555-7788,(171) 555-6750
4,BERGS,Berglunds snabbköp,Christina Berglund,Order Administrator,Berguvsvägen 8,Luleå,None,S-958 22,Sweden,0921-12 34 65,0921-12 34 67
...,...,...,...,...,...,...,...,...,...,...,...
86,WARTH,Wartian Herkku,Pirkko Koskitalo,Accounting Manager,Torikatu 38,Oulu,None,90110,Finland,981-443655,981-443655
87,WELLI,Wellington Importadora,Paula Parente,Sales Manager,"Rua do Mercado, 12",Resende,SP,08737-363,Brazil,(14) 555-8122,None
88,WHITC,White Clover Markets,Karl Jablonski,Owner,305 - 14th Ave. S. Suite 3B,Seattle,WA,98128,USA,(206) 555-4112,(206) 555-4115
89,WILMK,Wilman Kala,Matti Karttunen,Owner/Marketing Assistant,Keskuskatu 45,Helsinki,None,21240,Finland,90-224 8858,90-224 8858
90,WOLZA,Wolski Zajazd,Zbyszek Piestrzeniewicz,Owner,ul. Filtrowa 68,Warszawa,None,01-012,Poland,(26) 642-7012,(26) 642-7012

In [11]:
df_orderdetails

,order_id,customer_id,employee_id,order_date,required_date,shipped_date,ship_via,freight,ship_name,ship_address,ship_city,ship_region,ship_postal_code,ship_country
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil
3,10251,VICTE,3,1996-07-08,1996-08-05,1996-07-15,1,41.34,Victuailles en stock,"2, rue du Commerce",Lyon,None,69004,France
4,10252,SUPRD,4,1996-07-09,1996-08-06,1996-07-11,2,51.30,Suprêmes délices,"Boulevard Tirou, 255",Charleroi,None,B-6000,Belgium
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
825,11073,PERIC,2,1998-05-05,1998-06-02,None,2,24.95,Pericles Comidas clásicas,Calle Dr. Jorge Cash 321,México D.F.,None,05033,Mexico
826,11074,SIMOB,7,1998-05-06,1998-06-03,None,2,18.44,Simons bistro,Vinbæltet 34,Kobenhavn,None,1734,Denmark
827,11075,RICSU,8,1998-05-06,1998-06-03,None,2,6.19,Richter Supermarkt,Starenweg 5,Genève,None,1204,Switzerland
828,11076,BONAP,4,1998-05-06,1998-06-03,None,2,38.28,Bon app',"12, rue des Bouchers",Marseille,None,13008,France
829,11077,RATTC,1,1998-05-06,1998-06-03,None,2,8.53,Rattlesnake Canyon Grocery,2817 Milton Dr.,Albuquerque,NM,87110,USA

# Fase 2

In [12]:
import pandas as pd

# DataFrame de clientes (cada cliente tiene un ID único)
df_clientes = pd.DataFrame({
    "cliente_id": [1, 2, 3],
    "nombre": ["Ana", "Carlos", "Elena"]
})

# DataFrame de pedidos (un cliente puede hacer varios pedidos)
df_pedidos = pd.DataFrame({
    "pedido_id": [101, 102, 103, 104, 105],
    "cliente_id": [1, 2, 1, 3, 2],  # Relación many_to_one (varios pedidos por cliente)
    "producto_id": [1001, 1002, 1003, 1001, 1002]
})

# DataFrame de productos (cada pedido tiene un solo producto)
df_productos = pd.DataFrame({
    "producto_id": [1001, 1002, 1003],
    "nombre_producto": ["Laptop", "Celular", "Tablet"],
    "categoria_id": [10, 20, 10]  # Cada producto pertenece a una única categoría
})

# DataFrame de categorías (cada producto pertenece a una única categoría)
df_categorias = pd.DataFrame({
    "categoria_id": [10, 20],
    "nombre_categoria": ["Electrónica", "Telefonía"]
})

In [13]:
df_merged = df_pedidos.merge(df_clientes, on="cliente_id", validate="many_to_one")
df_merged

   pedido_id  cliente_id  producto_id  nombre
0        101           1         1001     Ana
1        102           2         1002  Carlos
2        103           1         1003     Ana
3        104           3         1001   Elena
4        105           2         1002  Carlos

In [14]:
df_merged = df_merged.merge(df_productos, on="producto_id", validate="many_to_one")
df_merged

   pedido_id  cliente_id  producto_id  nombre nombre_producto  categoria_id
0        101           1         1001     Ana          Laptop            10
1        102           2         1002  Carlos         Celular            20
2        103           1         1003     Ana          Tablet            10
3        104           3         1001   Elena          Laptop            10
4        105           2         1002  Carlos         Celular            20

In [15]:
df_final = df_merged.merge(df_categorias, on="categoria_id", validate="many_to_one")
df_final

,pedido_id,cliente_id,producto_id,nombre,nombre_producto,categoria_id,nombre_categoria
0,101,1,1001,Ana,Laptop,10,Electrónica
1,102,2,1002,Carlos,Celular,20,Telefonía
2,103,1,1003,Ana,Tablet,10,Electrónica
3,104,3,1001,Elena,Laptop,10,Electrónica
4,105,2,1002,Carlos,Celular,20,Telefonía

In [16]:
import pandas as pd

# DataFrame de pedidos detallados con cantidad, precio de venta y precio de compra
df_orderdetails = pd.DataFrame({
    "pedido_id": [101, 102, 103, 104, 105],
    "producto_id": [1001, 1002, 1003, 1001, 1002],
    "quantityOrdered": [2, 5, 3, 4, 1],  # Cantidad ordenada por cada pedido
    "priceEach": [1000, 200, 300, 1000, 200],  # Precio unitario de venta
    "buyPrice": [800, 150, 250, 800, 150]  # Precio unitario de compra
})

# Unimos df_orderdetails con df_productos para tener más contexto
df_merged = df_orderdetails.merge(df_productos, on="producto_id", validate="many_to_one")

# Agregamos las nuevas columnas
df_merged["venta"] = df_merged["quantityOrdered"] * df_merged["priceEach"]
df_merged["costo"] = df_merged["quantityOrdered"] * df_merged["buyPrice"]
df_merged["ganancia"] = df_merged["venta"] - df_merged["costo"]

# Mostramos el DataFrame actualizado
df_merged

,pedido_id,producto_id,quantityOrdered,priceEach,buyPrice,nombre_producto,categoria_id,venta,costo,ganancia
0,101,1001,2,1000,800,Laptop,10,2000,1600,400
1,102,1002,5,200,150,Celular,20,1000,750,250
2,103,1003,3,300,250,Tablet,10,900,750,150
3,104,1001,4,1000,800,Laptop,10,4000,3200,800
4,105,1002,1,200,150,Celular,20,200,150,50

In [17]:
# Agregamos las nuevas columnas
df_merged["venta"] = df_merged["quantityOrdered"] * df_merged["priceEach"]
df_merged["costo"] = df_merged["quantityOrdered"] * df_merged["buyPrice"]
df_merged["ganancia"] = df_merged["venta"] - df_merged["costo"]

df_merged

,pedido_id,producto_id,quantityOrdered,priceEach,buyPrice,nombre_producto,categoria_id,venta,costo,ganancia
0,101,1001,2,1000,800,Laptop,10,2000,1600,400
1,102,1002,5,200,150,Celular,20,1000,750,250
2,103,1003,3,300,250,Tablet,10,900,750,150
3,104,1001,4,1000,800,Laptop,10,4000,3200,800
4,105,1002,1,200,150,Celular,20,200,150,50

In [18]:
# Total de ventas agrupadas por categoría
# 1Agrupar los datos por categoría
df_ventas_agrupadas = df_merged.groupby("categoria_id")

# 2Seleccionar la columna "venta" y aplicar la suma
df_ventas_agrupadas = df_ventas_agrupadas["venta"].sum()

# 3Resetear el índice para convertirlo en un DataFrame normal
df_ventas_agrupadas = df_ventas_agrupadas.reset_index()
df_ventas_agrupadas

   categoria_id  venta
0            10   6900
1            20   1200

In [19]:
# Total de ventas agrupadas por categoría
# Agrupar los datos por categoría
df_ventas_agrupadas = df_merged.groupby("categoria_id")

print(df_ventas_agrupadas)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001BD14308A50>

In [20]:
# Seleccionar la columna "venta" y aplicar la suma
df_ventas_agrupadas = df_ventas_agrupadas["venta"].sum()

df_ventas_agrupadas

categoria_id
10    6900
20    1200
Name: venta, dtype: int64

In [21]:
# Resetear el índice para convertirlo en un DataFrame normal
df_ventas_agrupadas = df_ventas_agrupadas.reset_index()
df_ventas_agrupadas

   categoria_id  venta
0            10   6900
1            20   1200

# fase 3

In [22]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine

# Función para filtrar un DataFrame por fechas
def filtrar_por_fecha(df, columna_fecha, fecha_inicio, fecha_fin):
    """
    Filtra un DataFrame por un rango de fechas.
    Parámetros:
    - df (pd.DataFrame): DataFrame a filtrar.
    - columna_fecha (str): Nombre de la columna con fechas.
    - fecha_inicio (str): Fecha de inicio en formato 'YYYY-MM-DD'.
    - fecha_fin (str): Fecha de fin en formato 'YYYY-MM-DD'.
    Retorna:
    - pd.DataFrame: DataFrame filtrado por fecha.
    """
    df[columna_fecha] = pd.to_datetime(df[columna_fecha])  # Asegurar que es datetime
    resultado = df[(df[columna_fecha] >= fecha_inicio) & (df[columna_fecha] <= fecha_fin)]
    return resultado

# Función para generar reportes pivotados
def generar_reporte(df, index, columns, values, aggfunc):
    """
    Genera un reporte tipo tabla dinámica (pivot table).
    Parámetros:
    - df (pd.DataFrame): DataFrame base.
    - index (str): Columna(s) para las filas del pivot.
    - columns (str): Columna(s) para las columnas del pivot.
    - values (str): Columna con los valores a agregar.
    - aggfunc (str): Función de agregación ('sum', 'mean', etc.).
    Retorna:
    - pd.DataFrame: DataFrame pivotado.
    """
    return df.pivot_table(index=index, 
                          columns=columns, 
                          values=values, 
                          aggfunc=aggfunc, 
                          fill_value=0)

# Función para escribir un DataFrame en una base de datos
def escribir_en_db(df, tabla, engine, if_exists="replace"):
    """
    Guarda un DataFrame en PostgreSQL.
    Parámetros:
    - df (pd.DataFrame): DataFrame a guardar.
    - tabla (str): Nombre de la tabla en la base de datos.
    - engine (SQLAlchemy Engine): Conexión a la base de datos.
    - if_exists (str): Acción si la tabla ya existe ('replace', 'append', 'fail').
    """
    df.to_sql(tabla, con=engine, if_exists=if_exists, index=False)
    print(f"Tabla '{tabla}' guardada con éxito.")

# Creación de un DataFrame pequeño para probar
data = {
    "fecha": pd.date_range(start="2024-02-10", periods=10, freq="D"),
    "categoria": ["A", "B", "A", "C", "B", "C", "A", "B", "C", "A"],
    "ventas": [100, 150, 200, 120, 180, 90, 300, 170, 130, 250]
}

df_prueba = pd.DataFrame(data)

# Pruebas de las funciones
print("\n DataFrame Original:")
print(df_prueba)

#  Filtrar por fechas
df_filtrado = filtrar_por_fecha(df_prueba, "fecha", "2024-02-12", "2024-02-15")
print("\n DataFrame Filtrado:")
print(df_filtrado)

#  Generar un reporte pivotado
df_pivot = generar_reporte(df_prueba, index="fecha", columns="categoria", values="ventas", aggfunc="sum")
print("\n DataFrame Pivotado:")
print(df_pivot)

#  Guardar en base de datos (Ejemplo de conexión)
engine = create_engine("postgresql+psycopg2://postgres:Clase2024!@localhost:5432/northwind")
# escribir_en_db(df_prueba, "ventas_prueba", engine)  # Descomenta para ejecutar

 DataFrame Original:
       fecha categoria  ventas
0 2024-02-10         A     100
1 2024-02-11         B     150
2 2024-02-12         A     200
3 2024-02-13         C     120
4 2024-02-14         B     180
5 2024-02-15         C      90
6 2024-02-16         A     300
7 2024-02-17         B     170
8 2024-02-18         C     130
9 2024-02-19         A     250

 DataFrame Filtrado:
       fecha categoria  ventas
2 2024-02-12         A     200
3 2024-02-13         C     120
4 2024-02-14         B     180
5 2024-02-15         C      90

 DataFrame Pivotado:
categoria     A    B    C
fecha
2024-02-10  100    0    0
2024-02-11    0  150    0
2024-02-12  200    0    0
2024-02-13    0    0  120
2024-02-14    0  180    0
2024-02-15    0    0   90
2024-02-16  300    0    0
2024-02-17    0  170    0
2024-02-18    0    0  130
2024-02-19  250    0    0

In [23]:
def saludar(nombre):
    return f"Hola, {nombre}!"

print(saludar("Ana"))

Hola, Ana!

In [26]:
def escribir_en_db(df, tabla, engine, if_exists="replace"):
    """
    Guarda un DataFrame en PostgreSQL.
    Parámetros:
    - df (pd.DataFrame): DataFrame a guardar.
    - tabla (str): Nombre de la tabla en la base de datos.
    - engine (SQLAlchemy Engine): Conexión a la base de datos.
    - if_exists (str): Acción si la tabla ya existe ('replace', 'append', 'fail').
    """
    df.to_sql(tabla, con=engine, if_exists=if_exists, index=False)
    print(f"Tabla '{tabla}' guardada con éxito.")




# Guardar en base de datos (Ejemplo de conexión)
engine = create_engine("postgresql+psycopg2://postgres:1234@localhost:5432/northwind")
#escribir_en_db(df_prueba, "ventas_prueba", engine)  # Descomenta para ejecutar